chimarkhi/qtag-nrf-sdk12/nRF5_SDK_12.2.0_f012efa/examples/ble_peripheral/ble_app_temp_queuing/main.c
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
//   ble_conn_state_on_ble_evt(p_ble_evt);
//   pm_on_ble_evt(p_ble_evt);
//   ble_db_discovery_on_ble_evt(&m_ble_db_discovery, p_ble_evt);
	 ble_conn_params_on_ble_evt(p_ble_evt);
	 ble_nus_on_ble_evt(&m_nus, p_ble_evt);
//   ble_ias_on_ble_evt(&m_ias, p_ble_evt);
//   ble_lls_on_ble_evt(&m_lls, p_ble_evt);
//   ble_bas_on_ble_evt(&m_bas, p_ble_evt);
//   ble_ias_c_on_ble_evt(&m_ias_c, p_ble_evt);
//   ble_tps_on_ble_evt(&m_tps, p_ble_evt);
   bsp_btn_ble_on_ble_evt(p_ble_evt);
   on_ble_evt(p_ble_evt);
   ble_advertising_on_ble_evt(p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in] sys_evt  System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    fs_sys_event_handler(sys_evt);
    ble_advertising_on_sys_evt(sys_evt);
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;
//		SEGGER_RTT_printf(0,"Inside ble stack init \r\n");
    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;
	
    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
//		SEGGER_RTT_printf(0,"sd default config err: %d \r\n",err_code);
//		nrf_delay_ms(1000);
		APP_ERROR_CHECK(err_code);
//		SEGGER_RTT_printf(0,"softdevice enable default config err_code: %d\r\n",err_code);

		
    //Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
    err_code = softdevice_enable(&ble_enable_params);
//		SEGGER_RTT_printf(0,"sd enable err: %d \r\n",err_code);
//		nrf_delay_ms(1000);
		APP_ERROR_CHECK(err_code);

//		SEGGER_RTT_printf(0,"softdevice enable err_code: %d\r\n",err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
		APP_ERROR_CHECK(err_code);
//		SEGGER_RTT_printf(0,"softdevice ble evt handler err_code: %d\r\n",err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
//		SEGGER_RTT_printf(0,"sys evt err_code: %d\r\n",err_code);
		APP_ERROR_CHECK(err_code);	
	
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
    uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
            sleep_mode_enter();
            break;
				case BSP_EVENT_ADVERTISING_START:
						advertising_start();
        case BSP_EVENT_DISCONNECT:
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
            if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
            {
                err_code = ble_advertising_restart_without_whitelist();
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }
            }
            break;

        default:
            break;
    }
}

/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}



/**@brief Function for doing power management.
 */
static void power_manage(void)
{
		uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

/**
 * @brief Function for application main entry.
 */
int main(void)
{
		uint32_t err_code;
		bsp_board_leds_init();
		nrf_delay_ms(1000); // To allow for bounce during battery insertion 
	
		// Initialize.
		log_init();
		SEGGER_RTT_printf(0,"\r\n\n\n\nInitializing ...\n");

		APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
		err_code = bsp_init(BSP_INIT_LED, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), NULL);
		APP_ERROR_CHECK(err_code);

		SEGGER_RTT_printf(0,"Initializing Timers \n");
		timers_init();
		SEGGER_RTT_printf(0,"Timers Initialized \n");

		ble_stack_init();	
		gap_params_init();
		SEGGER_RTT_printf(0,"ble stack Initialized \n");		
			
		adc_configure();
		advertising_init();
		SEGGER_RTT_printf(0,"Adv Initialized \n");
		
		services_init();
		SEGGER_RTT_printf(0,"services Initialized \n");

		conn_params_init();
		SEGGER_RTT_printf(0,"Conn Params Initialized \n");
		
		err_code = twi_init(&twi);
		SEGGER_RTT_printf(0,"SHT31's I2C Initialized \n");

		// Wait for fds to be initialized before any read/write
		err_code =fds_bledb_init();
		SEGGER_RTT_printf(0,"fds init err: %d \n",err_code);
		APP_ERROR_CHECK(err_code);
		// POLL FOR INIT CALLBACK
		wait_for_fds_evt(FDS_EVT_INIT);
		
		
		#ifdef INIT_DEVICE

		SEGGER_RTT_printf(0,"\r\n\n----Device Flash Init Begin----\n");
		
		err_code = fds_file_delete(FILE_ID);
		SEGGER_RTT_printf(0,"file del err: %d \n",err_code);
		APP_ERROR_CHECK(err_code);				
		SEGGER_RTT_printf(0,"\r\n\n");
		// Wait for GC to complete on FILE
		wait_for_fds_evt(FDS_EVT_GC);
		
		SEGGER_RTT_printf(0,"Test writing data to EOM RECKEY:\r\n");
		uint32_t testData1[] = {0x46464646,0x46464646,0x46464646};
		err_code = fds_write(FILE_ID, REC_KEY_EOM, testData1, 3);
		APP_ERROR_CHECK(err_code); 
		// Wait for write done event
		wait_for_fds_evt(FDS_EVT_WRITE);


		SEGGER_RTT_printf(0,"Writing data to LASTSEEN record:\r\n");
		uint32_t testData[] = {0x00002223,0x00000000,0x00000000};
		err_code = fds_write(FILE_ID, REC_KEY_LASTSEEN, testData, 3);
		APP_ERROR_CHECK(err_code);
		// Wait for write done event
		wait_for_fds_evt(FDS_EVT_WRITE);
		
		SEGGER_RTT_printf(0,"----Device Flash Init Done----\r\n\n\n");
		#endif

		nrf_delay_ms(1000);
		
		tstamp_reckey_init();		

		// Start execution.
		nrf_delay_ms(1000);
		timers_start();
		SEGGER_RTT_printf(0,"Times Start.. \n");

		err_code = advertising_start();
		SEGGER_RTT_printf(0,"adv start err: %d \n",err_code);
		APP_ERROR_CHECK(err_code);
		SEGGER_RTT_printf(0,"Started Advertising \n");
		
		bsp_board_leds_on();
		

    // Enter main loop.
    for (;; )
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
